[
    {"word":"GEOLOGY", "definition":"The science which deals with the physical structure and substance of the earth, their history, and the processes which act on them."},
    {"word":"GEOPOLITICS", "definition":"Politics, especially international relations, as influenced by geographical factors."},
    {"word":"CARTOGRAPHY", "definition":"The science or practice of drawing maps."},
    {"word":"TOPOLOGY", "definition":"The study of geometrical properties and spatial relations unaffected by the continuous change of shape or size of figures."},
    {"word":"PHYSIOGRAPHICS", "definition":"The subfield of geography that studies physical patterns and processes of the Earth."},
    {"word":"AFRICA", "definition":"The second-largest continent, connected to Asia by the Isthmus of Suez and lying between the Mediterranean Sea and the Atlantic and Indian Oceans."},
    {"word":"CAPITAL", "definition":"The city or town that functions as the seat of government and administrative centre of a country or region."},
    {"word":"CONTINENT", "definition":"Any of the world's main continuous expanses of land."},
    {"word":"ASIA", "definition":"The largest continent with 60% of the earth's population."},
    {"word":"EQUATOR", "definition":"A line notionally drawn on the earth equidistant from the poles, dividing the earth into northern and southern hemispheres."},
    {"word":"MERIDIAN", "definition":"A circle of constant longitude passing through a given place on the earth's surface and the terrestrial poles."},
    {"word":"TRIBUTARY", "definition":"A river or stream flowing into a larger river or lake."},
    {"word":"LONGITUDE", "definition":"The angular distance of a place east or west of the Greenwich meridian, or west of the standard meridian of a celestial object, usually expressed in degrees and minutes."},
    {"word":"LATITUDE", "definition":"An instrument containing a magnetized pointer which shows the direction of magnetic north and bearings from it."},
    {"word":"COMPASS", "definition":"An instrument containing a magnetized pointer which shows the direction of magnetic north and bearings from it."},
    {"word":"ANALEMMA", "definition":"An analemma is a diagram showing the position of the Sun in the sky."},
    {"word":"HABITAT", "definition":"The natural home or environment of an animal, plant, or other organism."},
    {"word":"LAGOON", "definition":"A stretch of salt water separated from the sea by a low sandbank or coral reef."},
    {"word":"WEATHER", "definition":"The state of the atmosphere at a particular place and seconds as regards."},
    {"word":"EARTHQUAKE", "definition":"A sudden violent shaking of the ground, typically causing great destruction, as a result of movements within the earth's crust or volcanic action."},
    {"word":"NEWTON", "definition":"The International System of Units derived unit of force."},
    {"word":"EINSTEIN", "definition":"German-born theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics."},
    {"word":"DYNAMICS", "definition":"The branch of mechanics concerned with the motion of bodies under the action of forces."},
    {"word":"ENERGY", "definition":"Power derived from the utilization of physical or chemical resources, especially to provide light and heat or to work machines."},
    {"word":"PRESSURE", "definition":"Amount of force exerted per area."},
    {"word":"THERMODYNAMICS", "definition":"The branch of physical science that deals with the relations between heat and other forms of energy."},
    {"word":"INERTIA", "definition":"A property of matter by which it continues in its existing state of rest or uniform motion in a straight line, unless that state is changed by an external force."},
    {"word":"AMPLITUDE", "definition":"The maximum extent of a vibration or oscillation, measured from the position of equilibrium."},
    {"word":"VELOCITY", "definition":"The speed of something in a given direction."},
    {"word":"FARADAY", "definition":"English scientist who contributed to the study of electromagnetism and electrochemistry."},
    {"word":"KINEMATICS", "definition":"Geometry of motion."},
    {"word":"WAVE", "definition":"A disturbance that travels through a medium, transporting energy from one location (its source) to another location without transporting matter."},
    {"word":"GRAVITY", "definition":"The force that attracts a body towards the centre of the earth, or towards any other physical body having mass."},
    {"word":"MOMENTUM", "definition":"The quantity of motion of a moving body, measured as a product of its mass and velocity."},
    {"word":"CONDUCTION", "definition":"The process by which heat or electricity is directly transmitted through the material of a substance when there is a difference of temperature or of electrical potential between adjoining regions, without movement of the material."},
    {"word":"ELECTROMAGNET", "definition":"A soft metal core made into a magnet by the passage of electric current through a coil surrounding it."},
    {"word":"RADIATION", "definition":"The emission of energy as electromagnetic waves or as moving subatomic particles, especially high-energy particles which cause ionization."},
    {"word":"REFRACTION", "definition":"The fact or phenomenon of light, radio waves, etc. being deflected in passing obliquely through the interface between one medium and another or through a medium of varying density."},
    {"word":"VACUUM", "definition":"A space entirely devoid of matter."},
    {"word":"INDUCTION", "definition":"The act or process by which an electric or magnetic effect is produced in an electrical conductor or magnetizable body when it is exposed to the influence or variation of a field of force."},
    {"word":"VAR", "definition":"This is the most common way to create a variable in JavaScript."},
    {"word":"FUNCTION", "definition":"This keyword allows us to define our own functions in JavaScript."},
    {"word":"CONDITION", "definition":"A conditional statement is of the if-then format, and allows an application to decide between one or more courses of action, based on whether a particular condition is true."},
    {"word":"LOOP", "definition":"A structure in code where you perform the same action or actions multiple times in a row."},
    {"word":"OBJECT", "definition":"The basic data structure in JavaScript. It have properties, also known as keys, to which are assigned values."},
    {"word":"ARRAY", "definition":"A data structure, which can store elements of different data type."},
    {"word":"STRING", "definition":"It is a traditionally a sequence of characters, either as a literal constant or as some kind of variable."},
    {"word":"PRIMITIVE", "definition":"Data that is not an object and has no methods."},
    {"word":"ALGORITHM", "definition":"A list of steps to finish a task."},
    {"word":"DEBUGGING", "definition":"Finding and fixing errors in programs."},
    {"word":"FOR", "definition":"A loop with a predetermined beginning, end, and increment (step interval)."},
    {"word":"CAMELCASE", "definition":"The first word of the name is lowercase and each new word after that is capitalized."},
    {"word":"ITERATION", "definition":"A repetitive action or command typically created with programming loops."},
    {"word":"OUTPUT", "definition":"A way to get information out of a computer."},
    {"word":"PARAMETER", "definition":"An extra piece of information passed to a function to customize it for a specific need."},
    {"word":"ARGUMENT", "definition":"A value that is passed between programs, subroutines or functions."},
    {"word":"BOOLEAN", "definition":"An expression used for creating statements that are either TRUE or FALSE."},
    {"word":"CLASS", "definition":"A set of related objects with common properties."},
    {"word":"CONSTANT", "definition":"A term used to describe a value that does not change throughout the execution of the program"},
    {"word":"EXPRESSION", "definition":"A legal grouping of letters, symbols, and numbers being used to represent the value of one or more variables."}
]
